In [1]:
import pandas as pd
import numpy as np

In [2]:
# Series - pd.Series(data, index)

s1 = pd.Series([10,20,30,40,50])
# s1 = pd.Series([10,20,30,40,50], index=[0,1,2,3,4])

print(s1)
print(type(s1))

0    10
1    20
2    30
3    40
4    50
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
# accessing element from the series

print(s1[0])

10

In [4]:
# series with scalar values

Index = ['Jan', 'Feb', 'Mar']
s2 = pd.Series(10, index=Index)
print(s2)

Jan    10
Feb    10
Mar    10
dtype: int64

In [5]:
# series using dict

d = {10: 'Sanket', 20: 'Mathur', 30: 'Learning', 40: 'Programmer'}
s3 = pd.Series(d)
print(s3)

10        Sanket
20        Mathur
30      Learning
40    Programmer
dtype: object

In [7]:
# series using np.ndarray

s4 = pd.Series(np.array([10,20,30,40]))
print(s4)

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
# Dataframe - pd.DataFrame(data, index, columns)

data = {'Apples':[3,4,0,8], 'Mangoes':[3,5,2,1]}
df1 = pd.DataFrame(data, index=['A','B','C','D'])
print(df1)

   Apples  Mangoes
A       3        3
B       4        5
C       0        2
D       8        1

In [12]:
# Index of DataFrame

df1.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [10]:
# Columns of DataFrame

df1.columns

Index(['Apples', 'Mangoes'], dtype='object')

In [11]:
# Shape of the DataFrame

df1.shape

(4, 2)

In [14]:
# use of head function

print(df1.head(2))
# Rows from start 5 by default

print(df1.tail(2))
# Rows from end 5 by default

   Apples  Mangoes
A       3        3
B       4        5
   Apples  Mangoes
C       0        2
D       8        1

In [15]:
# info method

df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Apples   4 non-null      int64
 1   Mangoes  4 non-null      int64
dtypes: int64(2)
memory usage: 96.0+ bytes

In [16]:
# describe method

# statistical analysis of the dataframe
df1.describe()

         Apples   Mangoes
count  4.000000  4.000000
mean   3.750000  2.750000
std    3.304038  1.707825
min    0.000000  1.000000
25%    2.250000  1.750000
50%    3.500000  2.500000
75%    5.000000  3.500000
max    8.000000  5.000000

In [17]:
# Transpose the dataframe

df1.T

         A  B  C  D
Apples   3  4  0  8
Mangoes  3  5  2  1

In [5]:
# Selecting by label - loc

df1.loc[:, 'Apples']
# df1[['Apples']]

A    3
B    4
C    0
D    8
Name: Apples, dtype: int64

In [5]:
# Selection by position = iloc

df1.iloc[:, 0]

A    3
B    4
C    0
D    8
Name: Apples, dtype: int64

In [13]:
# Read dataset

d = pd.read_csv('Data/nba.csv')

# to read xlxs files and to pip install xlrd
"""
!pip install xlrd
d = pd.read_excel('File.xlxs')
"""

d.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [2]:
# custom label for index column

df = pd.read_csv('Data/IMDB-Movie-Data.csv', index_col='Title')

df.head()

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [7]:
# remove dupliacte

print('Shape of df = {}'.format(df.shape))
temp = df.append(df)
print('Shape of temp = {}'.format(temp.shape))

temp = temp.drop_duplicates()
print('Shape of temp after processing = {}'.format(temp.shape))

Shape of df = (1000, 11)
Shape of temp = (2000, 11)
Shape of temp after processing = (1000, 11)

In [8]:
# total number of null values in the dataset

df.isnull().sum()

Rank                    0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [11]:
# dropping null values

temp = df.dropna()
#default axis=0, for deleting rows pass axis=1
# pass how='all' if for deleting rows/columns only if all the values in that row/field in NaN

temp.shape

(838, 11)

In [5]:
# filling the null values

temp = df.fillna(np.mean)
print(temp.isnull().sum())
temp.head()

Rank                  0
Genre                 0
Description           0
Director              0
Actors                0
Year                  0
Runtime (Minutes)     0
Rating                0
Votes                 0
Revenue (Millions)    0
Metascore             0
dtype: int64

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40

In [6]:
# save the modified dataset into csv file - to_csv

temp.to_csv('Data/IMDB-Movie-Data-Modified.csv')

# use to_excel() for storing it in excel file
# use index=False to exclude index values